emacs/emacs-intro-bg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="bg" xml:lang="bg">
<head>
<title>Въведение в Емакс</title>
<!-- 2015-08-30 нд 17:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Andrey Kotlarski" />
<meta  name="description" content="Кратко въведение в Емакс"
 />
<meta  name="keywords" content="emacs,емакс,въведение" />
<link rel="stylesheet" type="text/css" href="../css/worg-classic.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Въведение в Емакс</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Въведение</a></li>
<li><a href="#sec-2">2. За какво основно го ползвам</a></li>
<li><a href="#sec-3">3. Още?</a></li>
<li><a href="#sec-4">4. Вътрешностите отвън</a></li>
<li><a href="#sec-5">5. Първи стъпки</a></li>
<li><a href="#sec-6">6. Сега накъде?</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Въведение</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs е операционна система дегизирана като текстов редактор (или
обратното).  Последващото е писмо, което имах навика да пращам на
хора, осмелили се да проявят интерес към това чудо.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> За какво основно го ползвам</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Текстов редактор (изненада) с огромни възможности за манипулация и
изследване на текст.  Много по-бързо и интуитивно могат да се
извършват повтарящи се нетривиални операции, за които единствена
друга алтернатива би била да се драсне програмка.
</li>

<li>Среда за куп езици за програмиране - въобще, относно различни,
редки, популярни, нови, стари - най-вероятно някой вече е написал
"мод" за него.  За голям брой малко популярни езици Emacs е
единственото&#x2026;нещо, което дава повече от оцветяване на ключови
думи.  За лисп-подобни езици си е стандарт (с разширението
Paredit<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> манипулирането на S-изрази<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup> става толкова здраво
(въобще и не става дума за броене на скоби), че влаченето по
без-структурния текст на други езици си е жива мъка).
</li>

<li>Графичен интерфейс към GDB.  Става почти като Visual Studio, хехе.
</li>

<li>Интеграция с доста GNU инструменти, особено удобен за ползване с
grep и make компилиране, проверка на правопис, системи за контрол
на версиите (няма значение дали става дума за git, svn, darcs,
mercurial&#x2026; Emacs предоставя унифициран интерфейс към основните им
функционалности).
</li>

<li>Удобен набор от diff функционалности<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>.
</li>

<li>Терминал (няколко :D).
</li>

<li>Електронна поща и nntp новини, четец на feed-ове&#x2026;
</li>

<li>В комбинация с w3m<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup> - много удобен текстов браузър (липсва
javascript и flash, което си е feature).
</li>

<li>В комбинация с mpd, mplayer или vlc - систематизатор на колекции от
музика и филми.
</li>

<li>Много удобен и функционален навигатор за файловата система.
</li>

<li>Това може да спада и към 2., но е отличен редактор за LaTeX<sup><a id="fnr.5" name="fnr.5" class="footref" href="#fn.5">5</a></sup>,
през който се драскат pdf документи и дори презентации.  Вече има
поддръжка за разглеждане на pdf-и.
</li>

<li>Ползвам разширения за онлайн речници, разни логически игрички
(освен вградените) и понякога психоаналитик :D Шегувам се, но си
има реализация на Eliza<sup><a id="fnr.6" name="fnr.6" class="footref" href="#fn.6">6</a></sup>.
</li>

<li>Интерфейс към mldonkey<sup><a id="fnr.7" name="fnr.7" class="footref" href="#fn.7">7</a></sup>.
</li>

<li>Четец на man pages и info наръчници.
</li>

<li>Организатор в обикновен текст "на батерии" с таблици, формули,
експорт към html, pdf, odf&#x2026; и много повече<sup><a id="fnr.8" name="fnr.8" class="footref" href="#fn.8">8</a></sup>.
</li>

<li>Това е малко специфично, но с разширение има удобен интерфейс за
търсене и разглеждане състоянието и описанието на Gentoo<sup><a id="fnr.9" name="fnr.9" class="footref" href="#fn.9">9</a></sup> (и
portage производни) пакети и флагове.
</li>

<li>Унифициран достъп до мрежови протоколи (ftp, ssh&#x2026;) и файлови
системи (включително su/sudo)<sup><a id="fnr.10" name="fnr.10" class="footref" href="#fn.10">10</a></sup>.
</li>

<li>В комбинация с biltbee<sup><a id="fnr.11" name="fnr.11" class="footref" href="#fn.11">11</a></sup> - универсален чат-клиент (google
talk, icq&#x2026;skype, хаха) минаващ през Emacs IRC клиент<sup><a id="fnr.12" name="fnr.12" class="footref" href="#fn.12">12</a></sup>.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Още?</h2>
<div class="outline-text-2" id="text-3">
<p>
Има разширения за видео обработка<sup><a id="fnr.13" name="fnr.13" class="footref" href="#fn.13">13</a></sup>, споделено ползване<sup><a id="fnr.14" name="fnr.14" class="footref" href="#fn.14">14</a></sup>,
аудио-управляем десктоп за хора с увредено зрение<sup><a id="fnr.15" name="fnr.15" class="footref" href="#fn.15">15</a></sup> и какво ли
още не.  Всичко това (и много повече) под шапката на един от
най-могъщите манипулатори на текстови структури.  Отгоре на всичко
Emacs върви в почти пълен блясък на всякакво "железо" - GNU/Linux,
BSD-та, Winblows, Solaris, Plan 9&#x2026; опасна работа!
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Вътрешностите отвън</h2>
<div class="outline-text-2" id="text-4">
<p>
Отличително явление е, че Emacs<sup><a id="fnr.16" name="fnr.16" class="footref" href="#fn.16">16</a></sup> в ядрото си е (Emacs) Lisp
интерпретатор, до който има почти неограничен достъп и възможност за
разглеждане, промяна <b>в движение</b>.  Зад всяко натискане на бутон или
друга активност стои Elisp функция, чиято документация и код могат да
бъдат разгледани и променяни в текущия момент и това да се отрази
веднага.  Естествено могат да се добавят нови функции, променливи,
макрота, hook-ове към съществуващи функции, клавишни комбинации и т.н.
</p>

<p>
Elisp<sup><a id="fnr.17" name="fnr.17" class="footref" href="#fn.17">17</a></sup> е пълнокръвен Lisp, макар и малко застарял (в момента се
работи над интеграция с Guile<sup><a id="fnr.18" name="fnr.18" class="footref" href="#fn.18">18</a></sup>, което би дало възможност да се
пишат разширения и на Scheme, JavaScript, Lua или каквото още дойде).
Специализиран е за текстообработка и има опасения, че е най-доброто, с
което човечеството разполага<sup><a id="fnr.19" name="fnr.19" class="footref" href="#fn.19">19</a></sup>.  Повечето платформи осигуряват
някакъв половинчат начин/език за писане на разширения, което ги прави
трудно използваеми и видимо по-лоши от вградените функционалности.  В
контраст с това, огромната (и нарастваща) част от Emacs е реализирана
на Elisp.  Крайният резултат е, че любопитен потребител практически
разполага със същите инструменти, каквито имат и разработчиците на
Emacs (това е в ДНК-то на Lisp).
</p>

<p>
Emacswiki<sup><a id="fnr.20" name="fnr.20" class="footref" href="#fn.20">20</a></sup> е място, където може да се намери всевъзможна
информация, трикове, разширения и прочие.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Първи стъпки</h2>
<div class="outline-text-2" id="text-5">
<p>
Може би е добре при пръв контакт да се направи клавишната комбинация
</p>

<p>
<b>C-h t</b> (C-h е нотация за &lt;ctrl&gt;+h, последвано от натискане на t)
която запознава с примитивни начини на ползване.  Стандартно
инсталиран, Emacs има достъп до собствената си документация с
</p>

<p>
<b>C-h i</b> (това стартира info браузъра на Emacs)
</p>

<p>
<b>m Emacs RET</b> (натиска се m, изписва се Emacs и се натиска &lt;enter&gt;)
</p>

<p>
Документацията може да бъде разглеждана с
</p>

<p>
<b>C-h i</b>
</p>

<p>
<b>m Elisp RET</b>
</p>

<p>
Няколко полезни комбинации за разглеждане на информация:
</p>

<p>
<b>C-h m</b> (описание на текущия "мод", което е набор от клавишни
комбинации, специфично оцветяване и функционалност и въобще състояние
на текущия буфер)
</p>

<p>
<b>C-h b</b> (описание на всички активни в този момент клавишни комбинации)
</p>

<p>
<b>C-h k</b> (последвано от клавишна комбинация, описва интерактивната
функция-команда, стояща зад тази комбинация)
</p>

<p>
<b>C-h f</b> (последвано от име на функция, описва функцията и дава връзка
към кода и)
</p>

<p>
<b>C-h v</b> (последвано от име на променлива, описва променливата)
</p>

<p>
В допълнение, с
</p>

<p>
<b>M-x</b> (приета нотация за &lt;alt&gt;+x)
</p>

<p>
последвано от име на команда (с подсказки) и &lt;enter&gt; изпълнява
командата.
</p>

<p>
<b>M-x ielm RET</b>
</p>

<p>
примерно стартира Elisp REPL<sup><a id="fnr.21" name="fnr.21" class="footref" href="#fn.21">21</a></sup>.
</p>

<p>
Когато сме в Elisp буфер (обикновено и <b>scratch</b> върши работа)
</p>

<p>
<b>C-x C-e</b> (това може да се изпълни по-лесно като се задържи &lt;ctrl&gt; и
последователно се натиснат x и e)
</p>

<p>
изпълнено след последната затваряща скоба на S-израз, го изпълнява.
Това може да е предефиниране или създаване на нова функция/променлива
или просто някакъв блок от Elisp код.  Това е основния начин за
мигновени промени.
</p>

<p>
При стартиране Emacs изпълнява <b>~/.emacs.d/init.el</b> или <b>~/.emacs</b>
файл, в който потребителят е свободен да зарежда допълнителни
разширения, променя настройки, дефинира
функции/макрота/променливи/клавишни комбинации и въобще изпълнява
какъвто и да е Elisp код.  Интернет е пълен с dot-emacs-овете на много
народ и това често е удобен начин начинаещ да си открадне по някоя
друга настройка за собствено ползване.  Моят текущ <b>.emacs</b> се намира
засега на
<a href="https://github.com/m00natic/dot-emacs">https://github.com/m00natic/dot-emacs</a>
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Сега накъде?</h2>
<div class="outline-text-2" id="text-6">
<p>
Това е, има много материал за разглеждане.  Както има лаф, "сигурен
тест дали нещо съществува е дали има порно с него"&#x2026;  е същото важи и
за Emacs Lisp разширенията<sup><a id="fnr.22" name="fnr.22" class="footref" href="#fn.22">22</a></sup>.
</p>

<p>
Последният да затвори скобата :)
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://www.emacswiki.org/emacs/ParEdit">http://www.emacswiki.org/emacs/ParEdit</a>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="http://en.wikipedia.org/wiki/S-expression">http://en.wikipedia.org/wiki/S-expression</a>
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
<a href="http://www.emacswiki.org/emacs/EdiffMode">http://www.emacswiki.org/emacs/EdiffMode</a>
</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p class="footpara">
<a href="http://w3m.sourceforge.net">http://w3m.sourceforge.net</a>
</p></div>

<div class="footdef"><sup><a id="fn.5" name="fn.5" class="footnum" href="#fnr.5">5</a></sup> <p class="footpara">
<a href="http://www.latex-project.org">http://www.latex-project.org</a>
</p></div>

<div class="footdef"><sup><a id="fn.6" name="fn.6" class="footnum" href="#fnr.6">6</a></sup> <p class="footpara">
<a href="http://en.wikipedia.org/wiki/ELIZA">http://en.wikipedia.org/wiki/ELIZA</a>
</p></div>

<div class="footdef"><sup><a id="fn.7" name="fn.7" class="footnum" href="#fnr.7">7</a></sup> <p class="footpara">
<a href="http://mldonkey.sourceforge.net/Main_Page">http://mldonkey.sourceforge.net/Main_Page</a>
</p></div>

<div class="footdef"><sup><a id="fn.8" name="fn.8" class="footnum" href="#fnr.8">8</a></sup> <p class="footpara">
<a href="http://orgmode.org">http://orgmode.org</a>
</p></div>

<div class="footdef"><sup><a id="fn.9" name="fn.9" class="footnum" href="#fnr.9">9</a></sup> <p class="footpara">
<a href="http://www.gentoo.org">http://www.gentoo.org</a>
</p></div>

<div class="footdef"><sup><a id="fn.10" name="fn.10" class="footnum" href="#fnr.10">10</a></sup> <p class="footpara">
<a href="http://www.emacswiki.org/cgi-bin/wiki/TrampMode">http://www.emacswiki.org/cgi-bin/wiki/TrampMode</a>
</p></div>

<div class="footdef"><sup><a id="fn.11" name="fn.11" class="footnum" href="#fnr.11">11</a></sup> <p class="footpara">
<a href="http://www.bitlbee.org">http://www.bitlbee.org</a>
</p></div>

<div class="footdef"><sup><a id="fn.12" name="fn.12" class="footnum" href="#fnr.12">12</a></sup> <p class="footpara">
<a href="http://www.emacswiki.org/emacs/ERC">http://www.emacswiki.org/emacs/ERC</a>
</p></div>

<div class="footdef"><sup><a id="fn.13" name="fn.13" class="footnum" href="#fnr.13">13</a></sup> <p class="footpara">
<a href="http://1010.co.uk/gneve.html">http://1010.co.uk/gneve.html</a>
</p></div>

<div class="footdef"><sup><a id="fn.14" name="fn.14" class="footnum" href="#fnr.14">14</a></sup> <p class="footpara">
<a href="http://www.emacswiki.org/emacs/Rudel">http://www.emacswiki.org/emacs/Rudel</a>
</p></div>

<div class="footdef"><sup><a id="fn.15" name="fn.15" class="footnum" href="#fnr.15">15</a></sup> <p class="footpara">
<a href="http://emacspeak.sourceforge.net">http://emacspeak.sourceforge.net</a>
</p></div>

<div class="footdef"><sup><a id="fn.16" name="fn.16" class="footnum" href="#fnr.16">16</a></sup> <p class="footpara">
<a href="http://www.gnu.org/software/emacs">http://www.gnu.org/software/emacs</a>
</p></div>

<div class="footdef"><sup><a id="fn.17" name="fn.17" class="footnum" href="#fnr.17">17</a></sup> <p class="footpara">
<a href="http://www.gnu.org/software/emacs/manual/html_node/elisp/index.html">http://www.gnu.org/software/emacs/manual/html_node/elisp/index.html</a>
</p></div>

<div class="footdef"><sup><a id="fn.18" name="fn.18" class="footnum" href="#fnr.18">18</a></sup> <p class="footpara">
<a href="http://www.gnu.org/software/guile">http://www.gnu.org/software/guile</a>
</p></div>

<div class="footdef"><sup><a id="fn.19" name="fn.19" class="footnum" href="#fnr.19">19</a></sup> <p class="footpara">
<a href="http://xahlee.org/emacs/elisp_text_processing_lang.html">http://xahlee.org/emacs/elisp_text_processing_lang.html</a>
</p></div>

<div class="footdef"><sup><a id="fn.20" name="fn.20" class="footnum" href="#fnr.20">20</a></sup> <p class="footpara">
<a href="http://www.emacswiki.org">http://www.emacswiki.org</a>
</p></div>

<div class="footdef"><sup><a id="fn.21" name="fn.21" class="footnum" href="#fnr.21">21</a></sup> <p class="footpara">
<a href="http://en.wikipedia.org/wiki/REPL">http://en.wikipedia.org/wiki/REPL</a>
</p></div>

<div class="footdef"><sup><a id="fn.22" name="fn.22" class="footnum" href="#fnr.22">22</a></sup> <p class="footpara">
<a href="http://youtu.be/D1sXuHnf_lo">http://youtu.be/D1sXuHnf_lo</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Andrey Kotlarski</p>
<p class="date">Created: 2015-08-30 нд 17:28</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
